app/views/shared/_posts.html.erb

<% @topic.posts.each do |post| %>
---
SELECT "posts".* FROM "posts" WHERE ("posts".topic_id = 2)