app/views/shared/_topics.html.erb

SELECT COUNT(*) FROM "posts" WHERE ("posts".topic_id = 1)
---
    <div class='cell-container-posts'>
        <span class='num-posts'><%= topic.posts.size %></span>