app/controllers/posts_controller.rb

SELECT "topics".* FROM "topics" WHERE "topics"."id" = 1 LIMIT 1
INSERT INTO "posts" ("votes", "created_at", "topic_id", "link", "updated_at", "user_id") VALUES (NULL, '2011-03-31 18:09:11.146546', 3, 'Thisasdfadsfadsfadsfadsfadsfadsfadsfasdfasdfsfadsfsadfasdfasfdasfadsfadsfadsfadsfasdfasdfsadfasdfadsfsadfadsfdsfadsfadsfasdf', '2011-03-31 18:09:11.146546', NULL)
UPDATE "posts" SET "votes" = 0, "user_id" = 1, "updated_at" = '2011-03-17 17:38:00.548457' WHERE "posts"."id" = 1
---
  def create
    @topic = Topic.find(params[:topic_id])
    link = params[:post][:link]
    begin
        uri = URI.parse(link)
        if uri.class != URI::HTTP and uri.class != URI::HTTPS
            redirect_to(@topic, :notice => "You have some strange protocol their")
            return
        end
        rescue URI::InvalidURIError
            redirect_to(@topic, :notice => "Shit is all fucked up")
            return
    end

    @post = @topic.posts.create(params[:post])
    @post.user_id = current_user.id

    respond_to do |format|
      if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = 14 LIMIT 1
SELECT "votes"."id" FROM "votes" WHERE "votes"."topic_id" = 3 AND "votes"."user_id" = 2 AND "votes"."post_id" = 14 LIMIT 1
INSERT INTO "votes" ("updated_at", "value", "user_id", "topic_id", "post_id", "created_at") VALUES ('2011-04-07 08:40:46.976475', NULL, 2, 3, 14, '2011-04-07 08:40:46.976475')
---
  def vote
    @post = Post.find(params[:post_id])

    has_voted = did_user_vote_on_topic_post?(@post.topic_id, @post.id)

    if !has_voted
        @votes = Vote.new

        @votes.topic_id = @post.topic_id
        @votes.user_id = current_user.id
        @votes.post_id = @post.id
        @votes.value = params[:vote]

        @votes.save