app/controllers/topics_controller.rb

  def show
    @topic = Topic.find(params[:id])

    if user_signed_in?
        user_id = current_user.id
        topic_id = @topic.id
        if !View.where(:topic_id => topic_id, :user_id => user_id).exists?
            new_view = View.new
            new_view.user_id = user_id
            new_view.topic_id = topic_id
            new_view.save
        end
    end


    @topic.posts = @topic.posts.sort!{|a,b| b.votes.sum(:value) <=> a.votes.sum(:value)}
---
SELECT "topics".* FROM "topics" WHERE "topics"."id" = 1 LIMIT 1
SELECT "views"."id" FROM "views" WHERE "views"."topic_id" = 3 AND "views"."user_id" = 2 LIMIT 1
INSERT INTO "views" ("user_id", "topic_id", "updated_at", "created_at") VALUES (1, 1, '2011-04-06 18:58:52.902960', '2011-04-06 18:58:52.902960')
SELECT "posts".* FROM "posts" WHERE ("posts".topic_id = 1)
SELECT "votes".* FROM "votes" WHERE "votes"."post_id" = 3 AND "votes"."topic_id" = 4
SELECT SUM("votes"."value") AS sum_id FROM "votes" WHERE "votes"."topic_id" = 1 AND "votes"."post_id" = 1

  def create
    @topic = Topic.new(params[:topic])
    @topic.user_id = current_user.id

    respond_to do |format|
      if @topic.save
---
INSERT INTO "topics" ("updated_at", "created_at", "votes", "title", "user_id") VALUES ('2011-03-22 18:55:29.952040', '2011-03-22 18:55:29.952040', NULL, 'aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa', 1)

  def update
    @topic = Topic.find(params[:id])

    respond_to do |format|
      if @topic.update_attributes(params[:topic])
---
SELECT "topics".* FROM "topics" WHERE "topics"."id" = 3 LIMIT 1
UPDATE "topics" SET "updated_at" = '2011-03-24 18:15:09.834225', "title" = 'This is a very long topic. I hope that by testing the length of the topic I can het it to form a paragraph and sort this shit out. Lets us try to make this topic even longer and see what happens. Hopefully we can just increase the height of the table.' WHERE "topics"."id" = 3