app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "topics".* FROM "topics" WHERE "topics"."user_id" = 1
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = 2
---
   def show
        @user = User.find(params[:id])
        @topics = Topic.find_all_by_user_id(@user.id)
        @posts = Post.find_all_by_user_id(@user.id)